Revit 2027 API
RibbonItemData Class
Base class used to contain information necessary to construct a RibbonItem in the Ribbon.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.UI.ItemData
 Autodesk.Revit.UI.RibbonItemData
 More
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class RibbonItemData : ItemData
Public Class RibbonItemData
	Inherits ItemData
public ref class RibbonItemData : public ItemData
type RibbonItemData =
    class
        inherit ItemData
    end
The RibbonItemData type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from ItemData)
LongDescription |  Long description of the command tooltip
Name |  The internal name of the item.
(Inherited from ItemData)
ToolTip |  The tooltip of item.
(Inherited from ItemData)
ToolTipImage | The image to show as a part of the button extended tooltip
Top
Methods
Name | Description
Dispose
(Inherited from ItemData)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetContextualHelp | Gets the contextual help bound with this control.
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
SetContextualHelp | Sets the contextual help bound with this button data.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
Autodesk.Revit.UI Namespace
Inheritance Hierarchy
System.Object
 Autodesk.Revit.UI.ItemData
 Autodesk.Revit.UI.RibbonItemData
 Autodesk.Revit.UI.ButtonData
 Autodesk.Revit.UI.ComboBoxData
 Autodesk.Revit.UI.ComboBoxMemberData
 Autodesk.Revit.UI.RadioButtonGroupData
 Autodesk.Revit.UI.TextBoxData